export function Introduction() {
  return (
    <section>
      <h3
        id="introduction"
        className="dark:border-dark-500 mt-10 scroll-mt-20 border-b border-gray-200 pb-1 text-lg font-semibold lg:text-2xl"
        data-heading="مقدمه"
        data-order="2"
      >
        <a href="#introduction">مقدمه</a>
      </h3>
      <div className="text-sm-plus mt-5 space-y-3">
        <p>
          Tailux یک قالب پیشرفته داشبورد مبتنی بر ری‌اکت است که برای توسعه‌دهندگانی طراحی شده که به دنبال کارایی، انعطاف و زیبایی هستند. این قالب با استفاده از Tailwind CSS ساخته شده و ترکیبی بی‌نقص از حالت روشن و تیره را ارائه می‌دهد تا تجربه کاربری چشم‌نوازی فراهم شود.
        </p>
        <p>
          با داشتن طرح‌های رنگی متنوع، حالت تک‌رنگ و چیدمان‌های فوق‌العاده واکنش‌گرا، Tailux به‌راحتی با هر پروژه‌ای سازگار می‌شود. معماری ماژولار و وابستگی‌های سبک آن، عملکرد سریع و مقیاس‌پذیری آسان را تضمین می‌کند.
        </p>
        <p>
          Tailux با ابزارهای قدرتمندی مانند React Hook Forms، TanStack Table و Headless UI ارائه می‌شود و همراه با اپلیکیشن‌های آماده (چت، ایمیل، کانبان و ...) و صفحات از پیش ساخته شده (راهنما، احراز هویت، خطاها و غیره) توسعه را سرعت می‌بخشد. ویجت‌های خلاقانه، جداول پیشرفته و کامپوننت‌های زیبا ساخت رابط‌های کاربری را ساده می‌کند.
        </p>
        <p>
          توسعه‌دهندگان از سفارشی‌سازی آسان، ابزارهای ساخت Yarn و ساختار مستندسازی‌شده لذت خواهند برد و کاربران نیز داشبوردهای جذاب برای نیازهای متنوع مانند فروش، آنالیتیکس، ارز دیجیتال، LMS و غیره را تجربه می‌کنند.
        </p>
        <p>
          Tailux با ترکیب عملکرد، کارایی و طراحی، قالبی ارائه می‌دهد که پروژه‌های شما را به سطح بعدی ارتقاء می‌بخشد.
        </p>
      </div>
    </section>
  );
}
