export function PostContent() {
  return (
    <div className="dark:text-dark-200 mt-6 text-base text-gray-600">
      <h1 className="dark:text-dark-50 text-xl font-medium text-gray-900 lg:text-2xl">
        ۳۱۳ ایده برای الگو و رنگ
      </h1>
      <h3 className="mt-1">
        با توجه به مشاهداتم در محل کار، فهرستی از کارهایی که باید به عنوان یک پزشک در محیط بیمارستان (به ویژه برای کارورزان و دانشجویان پزشکی) از آن‌ها اجتناب کرد، تهیه کرده‌ام:
      </h3>
      <img
        className="mt-5 h-80 w-full rounded-lg object-cover object-center"
        src="/images/objects/object-2.jpg"
        alt="postimage"
      />
      <p className="text-xs-plus dark:text-dark-300 mt-1 text-center text-gray-400">
        <span> عکس از </span>
        <a href="##" className="underline">
          Unsplash
        </a>
      </p>
      <br />
      <p>
        تغییرات عمده‌ای اخیراً در زندگی من رخ داده است، هم از نظر شخصی و هم حرفه‌ای. نزدیک به پنج سال از آغاز این وبلاگ می‌گذرد و بازگشت به پست‌های اردیبهشت ۸۳ تجربه جالبی است. فکر می‌کنم هدف دفترچه خاطرات و ژورنال‌ها هم همین است؛ فرصتی برای بازگشت و مرور افکار و ایده‌های گذشته. نوعی سفر ذهنی در زمان.
      </p>
      <br />
      <p>
        یک چیز قطعی است: من دیگر آن فرد سابق نیستم. در واقع، حتی نسبت به سال گذشته یا سال‌های قبل هم تغییر کرده‌ام. شاید بخشی از ترکیب بدنی آن فرد را داشته باشم (ما مرتباً سلول‌های بدنمان را از دست می‌دهیم و تولید می‌کنیم)، اما قطعاً در فرکانس متفاوتی هستیم.
      </p>
      <br />
      <p>
        کل این ماجرای وبلاگ‌نویسی به عنوان مستندسازی ایده‌های عجیب و غریب من شروع شد. آن زمان وقت زیادی داشتم و به همین دلیل پست‌ها زیاد بودند. با گذشت زمان، تعداد پست‌ها کمتر شد اما تمرکز آن‌ها کمی بیشتر شد. شاید هنوز هم تصادفی باشند و موضوع واحدی نداشته باشند، اما این وبلاگ از ابتدا قرار بود پراکنده و نامنظم باشد.
      </p>
      <br />
      <div className="dark:border-dark-400 border-l-4 border-gray-300 pl-4">
        <p className="dark:text-dark-100 font-medium text-gray-800 italic">
          چرا Tailwind استایل‌های پیش‌فرض h1 من را حذف می‌کند؟ چطور می‌توانم این را غیرفعال کنم؟ یعنی همه استایل‌های پایه دیگر را هم از دست می‌دهم؟
        </p>
      </div>
      <br />
      <p>
        یک چیز قطعی است: من دیگر آن فرد سابق نیستم. در واقع، حتی نسبت به سال گذشته یا سال‌های قبل هم تغییر کرده‌ام. شاید بخشی از ترکیب بدنی آن فرد را داشته باشم (ما مرتباً سلول‌های بدنمان را از دست می‌دهیم و تولید می‌کنیم)، اما قطعاً در فرکانس متفاوتی هستیم.
      </p>
      <br />
      <p>
        کل این ماجرای وبلاگ‌نویسی به عنوان مستندسازی ایده‌های عجیب و غریب من شروع شد. آن زمان وقت زیادی داشتم و به همین دلیل پست‌ها زیاد بودند. با گذشت زمان، تعداد پست‌ها کمتر شد اما تمرکز آن‌ها کمی بیشتر شد. شاید هنوز هم تصادفی باشند و موضوع واحدی نداشته باشند، اما این وبلاگ از ابتدا قرار بود پراکنده و نامنظم باشد.
      </p>
      <br />
      <ul className="dark:text-dark-100 list-inside list-disc font-medium text-gray-800">
        <li>
          حالا این داستانی است درباره اینکه چطور زندگی من کاملاً زیر و رو شد
        </li>
        <li>و دوست دارم یک دقیقه وقت بگذاری و همین‌جا بنشینی</li>
        <li>تا برایت تعریف کنم چطور شاهزاده شهری به نام بل-ایر شدم</li>
      </ul>
      <br />
      <p>
        تغییرات عمده‌ای اخیراً در زندگی من رخ داده است، هم از نظر شخصی و هم حرفه‌ای. نزدیک به پنج سال از آغاز این وبلاگ می‌گذرد و بازگشت به پست‌های اردیبهشت ۸۳ تجربه جالبی است. فکر می‌کنم هدف دفترچه خاطرات و ژورنال‌ها هم همین است؛ فرصتی برای بازگشت و مرور افکار و ایده‌های گذشته. نوعی سفر ذهنی در زمان.
      </p>
    </div>
  );
}
