import { ColorType } from "@/constants/app";

interface Label {
  id: string;
  color: ColorType;
  text: string;
}

interface Sender {
  uid: string;
  name: string;
  avatar?: string;
}

export interface Mail {
  id: string;
  date: string;
  title: string;
  body: string;
  isImportant: boolean;
  isUnread: boolean;
  labels: Label[];
  sender: Sender;
}

export const mailList: Mail[] = [
  {
    id: "mail-id-1",
    date: "1403-06-22",
    title: "اقدام لازم: تایید سفارش شما مورد نیاز است",
    body: "سلام الکس،\nاین ایمیل برای تایید سفارش اخیر شما ارسال شده است. برای اطمینان از تحویل بدون مشکل، لطفاً جزئیات سفارش خود را بررسی کرده و با کلیک روی لینک زیر تایید کنید.\n[لینک تایید]\nدر صورت داشتن هرگونه سوال، با ما تماس بگیرید.\nبا تشکر،\nتیم شرکت",
    isImportant: true,
    isUnread: true,
    labels: [
      {
        id: "1",
        color: "secondary",
        text: "کار",
      },
    ],
    sender: {
      uid: "1",
      name: "کانر گوزمان",
      avatar: "/images/avatar/avatar-3.jpg",
    },
  },
  {
    id: "mail-id-2",
    date: "1403-06-21",
    title: "دعوتنامه: به وبینار آینده ما در موضوع [موضوع] بپیوندید",
    body: "سلام لکسی،\nبا خوشحالی شما را به وبینار آینده‌مان در مورد [موضوع] دعوت می‌کنیم! این جلسه شامل [مروری کوتاه بر موضوعات] خواهد بود.\nدر [تاریخ] ساعت [زمان] [منطقه زمانی] به ما بپیوندید. همین حالا ثبت‌نام کنید تا جای خود را رزرو کنید!\n[لینک ثبت‌نام]\nمنتظر دیدار شما هستیم!\nبا احترام،\nتیم شرکت",
    isImportant: false,
    isUnread: true,
    labels: [],
    sender: {
      uid: "2",
      name: "جان دو",
      avatar: "/images/avatar/avatar-5.jpg",
    },
  },
  {
    id: "mail-id-3",
    date: "1403-06-21",
    title: "فرصت‌های شغلی توسعه‌دهنده فرانت‌اند در هفته گذشته",
    body: "تعداد شغل‌های جدید در کشور شما این هفته ثابت ماند. این فرصت‌های شغلی جدید را بررسی کنید.",
    isImportant: false,
    isUnread: false,
    labels: [],
    sender: {
      uid: "3",
      name: "تراویس فولر",
      avatar: "/images/avatar/avatar-19.jpg",
    },
  },
  {
    id: "mail-id-4",
    date: "1403-06-20",
    title: "به‌روزرسانی مهم: تغییرات در سیاست‌های شرکت",
    body: "تیم عزیز،\nمایلیم شما را از تغییرات اخیر در سیاست‌های شرکت مطلع کنیم. لطفاً سیاست‌های به‌روزشده پیوست شده به این ایمیل را بررسی کنید. در صورت داشتن سوال، با منابع انسانی تماس بگیرید.\nبا تشکر،\nمدیریت",
    isImportant: true,
    isUnread: false,
    labels: [],
    sender: {
      uid: "4",
      name: "امیلی واتسون",
      avatar: "/images/avatar/avatar-9.jpg",
    },
  },
  {
    id: "mail-id-5",
    date: "1403-06-19",
    title: "یادآوری: جلسات بازبینی عملکرد فصلی",
    body: "سلام تیم،\nیادآوری دوستانه که جلسات بازبینی عملکرد فصلی ما برای هفته آینده برنامه‌ریزی شده است. لطفاً مطمئن شوید که گزارش‌های ارزیابی خود را آماده کرده‌اید.\nبا احترام،\nواحد منابع انسانی",
    isImportant: false,
    isUnread: false,
    labels: [],
    sender: {
      uid: "5",
      name: "سارا جانسون",
      avatar: "/images/avatar/avatar-12.jpg",
    },
  },
  {
    id: "mail-id-6",
    date: "1403-06-18",
    title: "معرفی محصول جدید: اعلامیه هیجان‌انگیز!",
    body: "سلام مشتریان عزیز،\nبا خوشحالی راه‌اندازی جدیدترین محصول خود را اعلام می‌کنیم! برای اطلاعات بیشتر و پیشنهادات ویژه به وب‌سایت ما مراجعه کنید.\nاز حمایت همیشگی شما سپاسگزاریم!\nتیم شرکت",
    isImportant: false,
    isUnread: true,
    labels: [
      {
        id: "2",
        color: "primary",
        text: "تبلیغات",
      },
    ],
    sender: {
      uid: "6",
      name: "Marketing Team",
      avatar: undefined,
    },
  },
  {
    id: "mail-id-7",
    date: "1403-06-17",
    title: "درخواست بازخورد: نظرسنجی رضایت مشتری",
    body: "مشتری گرامی،\nما به بازخورد شما ارزش می‌دهیم! لطفاً چند دقیقه وقت بگذارید و نظرسنجی رضایت مشتری ما را تکمیل کنید. نظرات شما به ما در بهبود خدمات کمک می‌کند.\nاز اینکه مشتری ارزشمند ما هستید سپاسگزاریم.\nتیم شرکت",
    isImportant: false,
    isUnread: false,
    labels: [],
    sender: {
      uid: "7",
      name: "پشتیبانی مشتریان",
      avatar: "/images/avatar/avatar-18.jpg",
    },
  },
  {
    id: "mail-id-8",
    date: "1403-06-16",
    title: "اطلاعیه تعطیلی: دفتر در تاریخ [تاریخ] تعطیل است",
    body: "تیم عزیز،\nبه اطلاع می‌رساند که دفتر ما در تاریخ [تاریخ] به مناسبت تعطیلات بسته خواهد بود. لطفاً برنامه کاری خود را تنظیم کنید و از تعطیلات لذت ببرید.\nتعطیلات خوشی داشته باشید!\nمدیریت",
    isImportant: true,
    isUnread: true,
    labels: [],
    sender: {
      uid: "8",
      name: "اداره دفتر",
      avatar: "/images/avatar/avatar-20.jpg",
    },
  },
  {
    id: "mail-id-9",
    date: "1403-06-15",
    title: "فوری: اقدام لازم برای فاکتورهای معوقه",
    body: "سلام تیم،\nیادآوری می‌شود که برای فاکتورهای معوقه اقدام کنید. لطفاً با مشتریان پیگیری کرده و پرداخت به موقع را تضمین کنید.\nاز همکاری شما سپاسگزاریم.\nواحد مالی",
    isImportant: true,
    isUnread: false,
    labels: [
      {
        id: "3",
        color: "error",
        text: "فوری",
      },
    ],
    sender: {
      uid: "9",
      name: "Finance Department",
      avatar: undefined,
    },
  },
  {
    id: "mail-id-10",
    date: "1403-06-14",
    title: "خوش آمدید: جزئیات جلسه معارفه کارمند جدید",
    body: "کارمند جدید عزیز،\nبه تیم ما خوش آمدید! از حضور شما خوشحالیم. لطفاً جزئیات مربوط به جلسه معارفه خود را در پیوست مشاهده کنید.\nدر صورت داشتن سوال با منابع انسانی تماس بگیرید.\nبا احترام،\nواحد منابع انسانی",
    isImportant: false,
    isUnread: true,
    labels: [],
    sender: {
      uid: "10",
      name: "واحد منابع انسانی",
      avatar: "/images/avatar/avatar-17.jpg",
    },
  },
  {
    id: "mail-id-11",
    date: "1403-06-13",
    title: "رویداد پیش رو: جشن سالگرد شرکت",
    body: "سلام تیم،\nتاریخ جشن سالگرد شرکت را ذخیره کنید! روزی پر از فعالیت‌های سرگرم‌کننده و سورپرایز در پیش داریم. جزئیات بیشتر به زودی اعلام خواهد شد.\nمنتظر باشید!\nکمیته برنامه‌ریزی رویداد",
    isImportant: false,
    isUnread: false,
    labels: [],
    sender: {
      uid: "11",
      name: "کمیته برنامه‌ریزی رویداد",
      avatar: "/images/avatar/avatar-6.jpg",
    },
  },
  {
    id: "mail-id-12",
    date: "1403-06-12",
    title: "هشدار امنیتی: رمز عبور خود را فوراً تغییر دهید",
    body: "کاربر گرامی،\nفعالیت مشکوکی در حساب شما شناسایی شده است. به دلایل امنیتی، لطفاً رمز عبور خود را طبق دستورالعمل ایمیل پیوست شده فوراً تغییر دهید.\nاز همکاری شما سپاسگزاریم.\nتیم امنیت فناوری اطلاعات",
    isImportant: true,
    isUnread: true,
    labels: [
      {
        id: "4",
        color: "warning",
        text: "امنیتی",
      },
    ],
    sender: {
      uid: "12",
      name: "IT Security Team",
      avatar: undefined,
    },
  },
  {
    id: "mail-id-13",
    date: "1403-06-11",
    title: "فعالیت تیم‌سازی: با ما برای یک روز سرگرم‌کننده همراه شوید!",
    body: "سلام تیم،\nآماده یک روز فعالیت‌های تیم‌سازی و سرگرمی باشید! با ما همراه شوید تا روابط تیمی را تقویت کنیم و لحظات خوبی را کنار هم داشته باشیم.\nاین فرصت را از دست ندهید!\nکمیته تیم‌سازی",
    isImportant: false,
    isUnread: false,
    labels: [],
    sender: {
      uid: "13",
      name: "کمیته تیم‌سازی",
      avatar: "/images/avatar/avatar-16.jpg",
    },
  },
  {
    id: "mail-id-14",
    date: "1403-06-10",
    title: "تقدیر از عملکرد: جایزه کارمند ماه",
    body: "تیم عزیز،\nبا خوشحالی کارمند ماه مرداد را اعلام می‌کنیم. تبریک به [نام کارمند] بابت عملکرد عالی و تعهدشان.\nهمین‌طور ادامه دهید!\nمدیریت",
    isImportant: false,
    isUnread: true,
    labels: [],
    sender: {
      uid: "14",
      name: "مدیریت",
      avatar: "/images/avatar/avatar-5.jpg",
    },
  },
  {
    id: "mail-id-15",
    date: "1403-06-09",
    title: "به‌روزرسانی محصول: ویژگی‌ها و بهبودهای جدید",
    body: "سلام مشتریان عزیز،\nبا خوشحالی به اطلاع می‌رسانیم که محصول ما با ویژگی‌ها و بهبودهای جدید بر اساس بازخورد شما به‌روزرسانی شده است. برای اطلاعات بیشتر به وب‌سایت ما مراجعه کنید.\nاز حمایت همیشگی شما سپاسگزاریم!\nتیم محصول",
    isImportant: false,
    isUnread: false,
    labels: [],
    sender: {
      uid: "15",
      name: "تیم محصول",
      avatar: "/images/avatar/avatar-18.jpg",
    },
  },
  {
    id: "mail-id-16",
    date: "1403-06-08",
    title: "جلسه آموزشی: کارگاه آینده درباره [موضوع]",
    body: "سلام تیم،\nدر حال برنامه‌ریزی یک جلسه آموزشی درباره [موضوع] برای ارتقای مهارت‌ها و دانش شما هستیم. تاریخ را یادداشت کنید و منتظر جزئیات بیشتر باشید.\nمنتظر دیدار شما هستیم!\nواحد آموزش",
    isImportant: false,
    isUnread: true,
    labels: [],
    sender: {
      uid: "16",
      name: "Training Department",
      avatar: undefined,
    },
  },
  {
    id: "mail-id-17",
    date: "1403-06-07",
    title: "درخواست بازخورد: نظرسنجی رضایت کارکنان",
    body: "تیم عزیز،\nبازخورد شما برای ما مهم است! لطفاً چند دقیقه وقت بگذارید و نظرسنجی رضایت کارکنان را تکمیل کنید تا محیط کاری را بهبود دهیم.\nاز مشارکت شما سپاسگزاریم.\nواحد منابع انسانی",
    isImportant: false,
    isUnread: false,
    labels: [],
    sender: {
      uid: "17",
      name: "واحد منابع انسانی",
      avatar: "/images/avatar/avatar-18.jpg",
    },
  },
  {
    id: "mail-id-18",
    date: "1403-06-06",
    title: "ضرب‌الاجل پیش رو: موعد تحویل پروژه نزدیک است",
    body: "سلام تیم،\nیادآوری می‌شود که موعد تحویل پروژه نزدیک است. لطفاً مطمئن شوید که همه وظایف به موقع انجام شده‌اند. در صورت نیاز به کمک، اطلاع دهید.\nبا احترام،\nتیم مدیریت پروژه",
    isImportant: true,
    isUnread: false,
    labels: [
      {
        id: "5",
        color: "info",
        text: "ضرب‌الاجل",
      },
    ],
    sender: {
      uid: "18",
      name: "تیم مدیریت پروژه",
      avatar: "/images/avatar/avatar-11.jpg",
    },
  },
  {
    id: "mail-id-19",
    date: "1403-06-05",
    title: "اعلامیه شرکت: افتتاح دفتر جدید به زودی",
    body: "تیم عزیز،\nبا خوشحالی اعلام می‌کنیم که دفتر جدید ما به زودی افتتاح خواهد شد! منتظر جزئیات بیشتر درباره مراسم افتتاحیه و امکانات جدید باشید.\nاز حمایت همیشگی شما سپاسگزاریم.\nمدیریت",
    isImportant: false,
    isUnread: true,
    labels: [],
    sender: {
      uid: "19",
      name: "مدیریت",
      avatar: "/images/avatar/avatar-3.jpg",
    },
  },
  {
    id: "mail-id-20",
    date: "1403-06-04",
    title: "یادآوری آموزشی: کارگاه [موضوع] فردا برگزار می‌شود",
    body: "سلام تیم،\nیادآوری می‌شود که کارگاه [موضوع] فردا برگزار خواهد شد. حتماً حضور داشته باشید و در این جلسه آموزشی ارزشمند شرکت کنید.\nمنتظر دیدار شما هستیم!\nواحد آموزش",
    isImportant: false,
    isUnread: false,
    labels: [],
    sender: {
      uid: "20",
      name: "واحد آموزش",
      avatar: "/images/avatar/avatar-5.jpg",
    },
  },
  {
    id: "mail-id-21",
    date: "1403-06-03",
    title: "برنامه تعطیلات: تعطیلی دفتر به مناسبت [تعطیلات]",
    body: "تیم عزیز،\nبه اطلاع می‌رساند که دفتر ما در [تعطیلات] تعطیل خواهد بود. از تعطیلات لذت ببرید و این مناسبت را با عزیزانتان جشن بگیرید.\nتعطیلات خوشی داشته باشید!\nمدیریت",
    isImportant: false,
    isUnread: false,
    labels: [],
    sender: {
      uid: "21",
      name: "مدیریت",
      avatar: "/images/avatar/avatar-6.jpg",
    },
  },
  {
    id: "mail-id-22",
    date: "1403-06-02",
    title: "دموی محصول: به جلسه دموی زنده ما بپیوندید",
    body: "سلام کاربران عزیز،\nدموی زنده ما را از دست ندهید که ویژگی‌ها و قابلیت‌های محصول ما را نمایش می‌دهد. با ما همراه شوید تا محصول را در عمل ببینید و سوالات خود را بپرسید.\nمنتظر حضور شما هستیم.\nتیم محصول",
    isImportant: false,
    isUnread: true,
    labels: [],
    sender: {
      uid: "22",
      name: "تیم محصول",
      avatar: "/images/avatar/avatar-7.jpg",
    },
  },
  {
    id: "mail-id-23",
    date: "1403-06-01",
    title: "درخواست بازخورد: نظرسنجی ارزیابی برنامه آموزشی",
    body: "سلام تیم،\nبازخورد شما درباره برنامه آموزشی اخیر برای ما ارزشمند است. لطفاً چند دقیقه وقت بگذارید و نظرسنجی ارزیابی را تکمیل کنید و نظرات خود را با ما در میان بگذارید.\nاز همکاری شما سپاسگزاریم.\nواحد آموزش",
    isImportant: false,
    isUnread: false,
    labels: [],
    sender: {
      uid: "23",
      name: "Training Department",
      avatar: undefined,
    },
  },
  {
    id: "mail-id-24",
    date: "1403-05-31",
    title: "یادآوری: جلسه تیمی فردا ساعت [زمان]",
    body: "سلام تیم،\nیادآوری می‌شود که فردا ساعت [زمان] جلسه تیمی داریم. لطفاً حضور داشته باشید و برای بحث درباره به‌روزرسانی‌ها و اقدامات مهم آماده باشید.\nمنتظر دیدار شما هستیم!\nرهبر تیم",
    isImportant: false,
    isUnread: true,
    labels: [],
    sender: {
      uid: "24",
      name: "رهبر تیم",
      avatar: "/images/avatar/avatar-16.jpg",
    },
  },
  {
    id: "mail-id-25",
    date: "1403-05-30",
    title: "معرفی ویژگی جدید: داشبورد کاربری پیشرفته",
    body: "سلام کاربران عزیز،\nبا خوشحالی اعلام می‌کنیم که داشبورد کاربری پیشرفته ما با ویژگی‌ها و قابلیت‌های جدید منتشر شد. همین امروز وارد شوید و از امکانات جدید بهره‌مند شوید!\nاز اینکه پلتفرم ما را انتخاب کردید سپاسگزاریم.\nتیم توسعه",
    isImportant: false,
    isUnread: false,
    labels: [],
    sender: {
      uid: "25",
      name: "تیم توسعه",
      avatar: "/images/avatar/avatar-4.jpg",
    },
  },
];
